awesomeapp/app/views/projects/index.html.erb

SELECT "activities"."id" FROM "activities" WHERE "activities"."finish" = $1  [["finish", true]]
SELECT COUNT(*) FROM "activities" WHERE (project_id = 1 AND finish = false)
SELECT "activities".* FROM "activities" WHERE (project_id = 22 AND end_date < '2021-06-05') ORDER BY "activities"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "activities" WHERE (project_id = 22 AND end_date > '2021-06-05') LIMIT $1  [["LIMIT", 1]]
---

    <% project_finished = Activity.finished(project.id).size.to_f * 100 / Activity.no_finished(project.id).size.to_f %>
    <% deley_compared   = Activity.delay_date(project.id, project.end_date).exists?  %>