awesomeapp/app/controllers/activities_controller.rb

    def index
        @activity = Activity.all
---
SELECT "activities".* FROM "activities" WHERE (finish = true)

    def create

        @activity = Activity.new(activity_params)

        respond_to do |format|
            if @activity.save
---
INSERT INTO "activities" ("name_activity", "start_date", "end_date", "finish", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def destroy

        respond_to do |format|
            if @activity.destroy
---
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 7]]

    def find_activity
        @activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]