awesomeapp/app/controllers/projects_controller.rb

    def index
        @project = Project.all
---
SELECT "projects"."id" FROM "projects"

    def create

        @project = Project.new(params_project)

        respond_to do |format|
           if @project.save
---
INSERT INTO "projects" ("name", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Outro Projeto"], ["start_date", "2021-05-30"], ["end_date", "2021-05-31"], ["created_at", "2021-05-31 02:51:54.662713"], ["updated_at", "2021-05-31 02:51:54.662713"]]

    def destroy
        respond_to do |format|
            if @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 18]]

    def params_find
        @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]