awesomeapp/app/views/activities/_form.html.erb

<%= f.label :name, "Selecione um projeto:" %> <br>
<%= f.collection_select(:project_id, Project.all, :id, :name) %>
---
SELECT "projects".* FROM "projects"